from dataclasses import dataclass
from envparse import env
from core.objects import Translations

env.read_envfile()


@dataclass(eq=False)
class T(Translations):
    ru: str
    ua: str


CITY_BY_REGION = {
    T('Одесса', 'Одеса'): [
        T('Одесса', 'Одеса'),
        T('Черноморск', 'Чорноморськ'),
        T('Грибовка', 'Грибівка'),
        T('Затока', 'Затока'),
        T('Измаил', 'Ізмаїл'),
        T('Каролино-Бугаз', 'Кароліно-Бугаз'),
        T('Коблево', 'Коблеве'),
        T('Южный', 'Южне'),
        T('Белгород-Днестровский', 'Білгород-Дністровський'),
    ],

    T('Киев', 'Київ'): [
        T('Киев', 'Київ'),
        T('Белая Церковь', 'Біла Церква'),
        T('Борисполь', 'Бориспіль'),
        T('Боярка', 'Боярка'),
        T('Бровары', 'Бровари'),
        T('Буча', 'Буча'),
        T('Вишневое', 'Вишневе'),
        T('Вышгород', 'Вишгород'),
        T('Ирпень', 'Ірпінь'),
        T('Украинка', 'Українка'),
        T('Фастов', 'Фастів'),
    ],

    T('Харьков', 'Харків'): [
        T('Харьков', 'Харків'),
        T('Лозовая', 'Лозова'),
        T('Купянск', "Куп'янськ"),
        T('Изюм', 'Ізюм'),
    ],

    T('Днепр', 'Дніпр'): [
        T('Днепр', 'Дніпр'),
        T('Кривой Рог', 'Кривий Ріг'),
        T('Каменское', "Кам'янське"),
        T('Никополь', 'Нікополь'),
        T('Павлоград', 'Павлоград'),
        T('Новомосковск', 'Новомосковськ'),
    ],

    T('Львов', 'Львів'): [
        T('Львов', 'Львів'),
        T('Борислав', 'Борислав'),
        T('Дрогобыч', 'Дрогобич'),
        T('Самбор', 'Самбір'),
        T('Стрый', 'Стрий'),
        T('Червоноград', 'Червоноград'),
    ],
}

AD_PRICE_BY_VACANCIES_AMOUNT = {1: 200, 2: 300, 3: 400}
AD_PHOTO_MIN_RATIO = 1
PIN_PRICE = 1000
DUPLICATE_PRICE_BY_VACANCIES_AMOUNT = {1: 800, 2: 1200, 3: 1600}

MERCHANT_ID = env('MERCHANT_ID')
MERCHANT_SECRET_KEY = env('MERCHANT_SECRET_KEY')
HOST = env('HOST')
PAYMENT_ENDPOINT = '/payment'
