from .config import T
from . import config

main_menu = T('Главное меню:', 'Головне меню:')

no_my_ads = T('У вас еще нет объявлений', 'У вас ще немає оголошень')

must_contain_digits = T(
    'Этот параметр обязательно должен содержать цифры',
    "Цей параметр обов'язково має бути вказаний цифрами і буквами",
)

too_long_text = T(
    'Слишком длинный ответ, максимальная длина: {}',
    'Занадто довга відповідь, максимальна довжина: {}',
)

create_ad_info = T("""
》 Чтобы создать объявление, вам необходимо пройти поэтапно несколько следующих шагов:

1) Указать основную информацию о заведении
2) Добавить от 1 до 3-х вакансий
3) Указать дополнительную информацию/услуги/контакты

В самом конце можно посмотреть, как будет выглядеть ваше объявление, и при необходимости изменить любую информацию
""", """
》 Щоб створити оголошення, вам необхідно пройти поетапно декілька наступних кроків:

1) Вказати основну інформацію про заклад
2) Додати від 1 до 3-х вакансій
3) Вказати додаткову інформацію/послуги/контакти

У самому кінці можна подивитися, як виглядатиме ваше оголошення і при необхідності змінити будь-яку інформацію 
""")

ask_region = T('Выберите областной город:', 'Виберіть обласне місто:')
ask_city = T('Выберите один из городов:', 'Виберіть одне з міст:')

ask_institution_type = T("""
🏨 <b>Укажите ваш тип заведения:</b>
(ресторан, бар, кафе, кофейня, отель, кальянная, гостиница, паб и другое)
""", """🏨 <b>Вкажіть ваш тип закладу:</b>
(ресторан, бар, кафе, кав'ярня, отель, кальянная, готель, паб і інше)
""")

ask_institution_name = T("""
⚜️ <b>Укажите название заведения</b>
(пример: Alaska, Jord, Catch, Azuma, Fratelli, Goodman, Coast и так далее)
""", """
⚜️ <b>Вкажіть назву закладу</b>
(наприклад: Alaska, Jord, Catch, Azuma, Fratelli, Goodman, Coast і так далі)
""")

ask_institution_address = T("""
📍 <b>Укажите адрес заведения</b>
(пример: улица, переулок, площадь, бульвар, проспект и так далее)
""", """
📍 <b>Вкажіть адресу закладу</b>
(наприклад: вулиця, провулок, площа, бульвар, проспект і так далі)
""")

ask_vacancies_amount = T(
    'Выберите, сколько вакансий Вы планируете размещать?',
    'Виберіть, скільки вакансій Ви плануєте розміщувати?',
)

vacancy_num = T('<b>Вакансия №{}</b>', '<b>Вакансія №{}</b>')

ask_vacancy_title = T("""
<b>👤 Укажите название вакансии:</b>
(повар, официант, бармен, бариста, посудомойщица, уборщица и т.д.)
""", """
👤 <b>Вкажіть назву вакансії:</b>
(кухар, офіціант, бармен, бариста, посудомийниця, прибиральниця і т.д.)
""")

ask_work_experience = T("""
📈 <b>Требуемый опыт работы</b>
(например: от 1-го года, от 2-х лет, от 5-ти лет, не обязателен и т.д.)
""", """
📈 <b>Необхідний досвід роботи</b>
(наприклад: від 1-го року, від 2-х років, від 5-ти років, не обов'язковий і т.д.)
""")

ask_salary = T("""
💵 <b>Укажите зарплату (в цифрах)</b>
(ставка, процент, смена, в месяц, +бонусы, + премиальные и т.д.)
""", """
💵 <b>Вкажіть зарплату (у цифрах)</b>
(ставка, відсоток, зміна, на місяць, +бонуси, +преміальні і т.д.)
""")

ask_schedule = T("""
📆 <b>Укажите график работы</b>
(пример: 3/3, 5/2, суточный ½)
""", """
📆 <b>Вкажіть графік роботи</b>
(наприклад: 3/3, 5/2, добовий ½)
""")

ask_working_hours = T("""
⏰ <b>Укажите время работы</b>
(пример: с 08.30 до 22.00)
""", """
⏰ <b>Вкажіть час роботи</b>
(наприклад: з 08.30 до 22.00)
""")

ask_extra_info = T("""
📝 <b>Дополнительная информация</b>
(желаемый пол, возраст, питание, оплата такси, оформление и т.д.)
""", """
📝 <b>Додаткова інформація</b>
(бажана стать, вік, харчування, оплата таксі, оформлення і т.д.)
""")

vacancies_filled = T('✅ <b>Вакансии заполнены</b>', '✅ <b>Вакансії заповнені</b>')

phone_format = '+38 xxx xxx xx xx'

ask_contact_phone = T(f"""
☎️ <b>Укажите ваш контактный номер:</b>
(нажмите на кнопку или напишите номер в формате: {phone_format})
""", f"""
☎️ <b>Вкажіть ваш контактний номер:</b>
(натисніть на кнопку або напишіть номер у форматі: {phone_format})
""")

invalid_contact_phone = T(
    f'Введите телефон в правильном формате: {phone_format}',
    f'Введіть телефон в правильному форматі: {phone_format}',
)

ask_photo = T("""
🎞 <b>Отправьте фотографию</b>
(горизонтальную – 16:9 / 4:3)
""", """
🎞 <b>Надішліть фотографію</b>
(горизонтальну – 16:9 / 4:3)
""")

ask_photo_not_document = T(
    'Пожалуйста, отправьте изображение как фото, а не как файл',
    'Будь ласка, надішліть зображення як фото, а не як файл',
)

ask_pin_option = T(
    '📌 <b>Закрепить объявление на неделю в шапке канала?</b>',
    '📌 <b>Закріпити оголошення на тиждень в шапці каналу?</b>',
)

post_date_format = T('ДД.ММ.ГГ ЧЧ:ММ', 'ДД.ММ.РР ЧЧ:ХХ')
post_date_example = T('(пример: 09.06.21 12:00)', '(наприклад: 09.06.21 12:00)')

ask_post_date = T(f"""
📆 <b>Укажите дату и время размещения поста</b> \
(используйте кнопку "Пропустить", если вы хотите разместить пост прямо сейчас)

<b>Время указывайте в формате:</b>
》 {post_date_format.ru}
》 {post_date_example.ru}
""", f"""
📆 <b>Вкажіть дату і час розміщення поста</b> \
(використовуйте кнопку "Пропустити", якщо ви хочете розмістити пост прямо зараз)

Час вказуйте в форматі:
》{post_date_format.ua}
》{post_date_example.ua}
""")

ask_duplicate_option = T(
    '📑 <b>Дублировать ли ежедневно объявление в течении недели?</b>',
    '📑 <b>Дублювати чи щодня оголошення протягом тижня?</b>',
)

invalid_post_date = T(f"""
<b>Укажите время в правильном формате:</b> {post_date_format.ru}
{post_date_example.ru}
""", f"""
<b>Вкажіть час в правильному форматі:</b> {post_date_format.ua}
{post_date_example.ua}
""")

ask_later_post_date = T(
    'Ошибка, укажите, пожалуйста, время больше текущего',
    'Помилка, вкажіть, будь ласка, час більше поточного',
)

ask_whether_to_edit_ad = T(
    'Хотите ли вы изменить какую-либо информацию в данном объявлении?',
    'Чи бажаєте ви змінити яку-небудь інформацію в цьому оголошенні?',
)

no_such_vacancy = T('Нет такой вакансии', 'Немає такої вакансії')

create_ad = T('📝 Создать объявление', '📝 Створити оголошення')
my_ads = T('📁 Мои объявления', '📁 Мої оголошення')
tech_support = T('👨‍💻 Техподдержка', '👨‍💻 Техпідтримка')
our_site = T('🌐 Наш сайт', '🌐 Наш сайт')
change_lang = T('{flag} Сменить язык', '{flag} Змінити мову')

one_vacancy_price = T(
    f'1 вакансия - {config.AD_PRICE_BY_VACANCIES_AMOUNT[1]} грн.',
    f'1 вакансія - {config.AD_PRICE_BY_VACANCIES_AMOUNT[1]} грн.',
)
two_vacancies_price = T(
    f'2 вакансии - {config.AD_PRICE_BY_VACANCIES_AMOUNT[2]} грн.',
    f'2 вакансії - {config.AD_PRICE_BY_VACANCIES_AMOUNT[2]} грн.',
)
three_vacancies_price = T(
    f'3 вакансии - {config.AD_PRICE_BY_VACANCIES_AMOUNT[3]} грн.',
    f'3 вакансії - {config.AD_PRICE_BY_VACANCIES_AMOUNT[3]} грн.',
)

skip = T('Пропустить', 'Пропустити')

send_self_phone = T('Отправить свой номер телефона', 'Надіслати свій номер телефону')

back = T('🔙 Назад', '🔙 Назад')

not_pin = T('Не закреплять', 'Не закріплювати')
pin_for = T(f'Закрепить - {config.PIN_PRICE} грн.', f'Закріпити - {config.PIN_PRICE} грн.')

not_duplicate = T('Не дублировать', 'Не дублювати')
duplicate_for = T('Дублировать - {price} грн.', 'Дублювати - {price} грн.')
change_institution_info = T('Информацию о компании', 'Інформація про компанію')
change_vacancy_num = T('Вакансию № {num}', 'Вакансію № {num}')
change_other_info = T('Другую информацию', 'Іншу інформацію')
all_correct = T('Нет, все хорошо', 'Ні, все добре')

city = T('Город', 'Місто')
institution_type = T('Тип заведения', 'Тип закладу')
institution_name = T('Название заведения', 'Назва закладу')
institution_address = T('Адрес заведения', 'Адреса закладу')

vacancy_title = T('Название вакансии', 'Назва вакансії')
work_experience = T('Требуемый опыт работы', 'Необхідний досвід роботи')
salary = T('Заработная плата', 'Заробітна плата')
schedule = T('График работы', 'Графік роботи')
working_hours = T('Время работы', 'Час роботи')

extra_info = T('Дополнительная информация', 'Додаткова інформація')
contact_phone = T('Контактный номер телефона', 'Контактний номер телефону')
institution_photo = T('Фотография заведения', 'Фотографія закладу')
post_date = T('Время размещения поста', 'Час розміщення поста')
pin_option = T('Опция «Закрепление»', 'Опція: «Закріплення»')
duplicate_option = T('Опция «Дублирование»', 'Опція:  «Дублювання»')

pay_up = T('Оплатить', 'Оплатити')

invoice_ad_price = T("""
Заказ принят! Ссылка для оплаты:
------------------------------------------------
📝 Цена объявления: {price}₴
""", """
Замовлення прийняте! Посилання для оплати:
------------------------------------------------
📝 Ціна оголошення: {price}₴
""")

invoice_pin_price = T('📌 Закрепление: +{price}₴', '📌 Закріплення: +{price}₴')
invoice_duplicate_price = T('📑 Дублирование: +{price}₴', '📑 Дублювання: +{price}₴')

invoice_total_price = T("""\
------------------------------------------------
💵 <b>Итого к оплате – {price}₴</b>
""", """\
------------------------------------------------
💵 <b>Разом до сплати – {price}₴</b>
""")

ad_institution_template = T("""
<b>В {type} «{name}»</b>
{address}
требуется:
""", """
<b>В {type} «{name}»</b>
{address}
потрібен:
""")

ad_vacancy_template = T("""
 • <b>{title}</b>
Опыт работы {work_experience}
З/п 💵 {salary}
📆 График работы {schedule}
⏰ {working_hours}
""", """
 • <b>{title}</b>
Досвід роботи {work_experience}
З/п 💵 {salary}
📆 Графік роботи {schedule}
⏰ {working_hours}
""")

ad_other_info_template = T("""
{extra_info}

Обращаться по тел.:
📲 {contact_phone}\
<a href="{photo_url}">&#8203;</a>
""", """
{extra_info}

Звертатися за тел.:
📲 {contact_phone}\
<a href="{photo_url}">&#8203;</a>
""")

ad_template = """
{institution}

{vacancies}

{other_info}
"""
